plotMachineIOPS_LATENCY/fio_output/write-1jobs-128files-4k.fio_fuse_boc.out
jobs1: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (128 files / total 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=530934: Wed Jul 26 00:35:22 2023
  write: IOPS=229k, BW=894MiB/s (937MB/s)(30.0GiB/34370msec); 0 zone resets
    slat (nsec): min=1445, max=132730k, avg=3711.01, stdev=149792.10
    clat (nsec): min=1607, max=272891k, avg=553567.23, stdev=1731420.74
     lat (usec): min=3, max=272897, avg=557.36, stdev=1739.86
    clat percentiles (usec):
     |  1.00th=[  285],  5.00th=[  289], 10.00th=[  293], 20.00th=[  310],
     | 30.00th=[  334], 40.00th=[  351], 50.00th=[  363], 60.00th=[  371],
     | 70.00th=[  392], 80.00th=[  437], 90.00th=[  457], 95.00th=[  478],
     | 99.00th=[12518], 99.50th=[14615], 99.90th=[15926], 99.95th=[17171],
     | 99.99th=[19530]
   bw (  KiB/s): min=332704, max=1239160, per=99.94%, avg=914667.06, stdev=140290.18, samples=68
   iops        : min=83176, max=309790, avg=228666.79, stdev=35072.60, samples=68
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=97.19%, 750=1.39%, 1000=0.01%
  lat (msec)   : 2=0.02%, 10=0.13%, 20=1.26%, 50=0.01%, 100=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%
  cpu          : usr=15.17%, sys=51.13%, ctx=1022, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,7864320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=894MiB/s (937MB/s), 894MiB/s-894MiB/s (937MB/s-937MB/s), io=30.0GiB (32.2GB), run=34370-34370msec