plotMachineIOPS_LATENCY/fio_output/write-1jobs-1files-32k.fio_fuse_ext4.out
jobs1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO file (1 file / 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=159903: Tue Jul 25 18:34:26 2023
  write: IOPS=54.3k, BW=1698MiB/s (1780MB/s)(30.0GiB/18094msec); 0 zone resets
    slat (usec): min=7, max=203637, avg=17.78, stdev=271.90
    clat (nsec): min=1424, max=520623k, avg=2298067.33, stdev=2856994.24
     lat (usec): min=12, max=520655, avg=2315.93, stdev=2907.53
    clat percentiles (usec):
     |  1.00th=[  1221],  5.00th=[  1237], 10.00th=[  1745], 20.00th=[  1827],
     | 30.00th=[  1860], 40.00th=[  1893], 50.00th=[  1926], 60.00th=[  1991],
     | 70.00th=[  2180], 80.00th=[  3097], 90.00th=[  3228], 95.00th=[  3326],
     | 99.00th=[  3687], 99.50th=[ 12649], 99.90th=[ 20055], 99.95th=[ 21890],
     | 99.99th=[208667]
   bw (  MiB/s): min= 1184, max= 2179, per=100.00%, avg=1744.93, stdev=432.74, samples=35
   iops        : min=37902, max=69750, avg=55837.54, stdev=13847.64, samples=35
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=61.57%, 4=37.47%, 10=0.09%, 20=0.77%, 50=0.09%
  lat (msec)   : 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=6.55%, sys=86.06%, ctx=118, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,983040,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1698MiB/s (1780MB/s), 1698MiB/s-1698MiB/s (1780MB/s-1780MB/s), io=30.0GiB (32.2GB), run=18094-18094msec