plotMachineIOPS_LATENCY/fio_output/write-32jobs-1024files-32k.fio_tmpfs.out
jobs1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (1024 files / total 30720MiB)
fio: pid=1169936, err=24/file:filesetup.c:805, func=open(/home/sevag/tmpfs//f1018), error=Too many open files

jobs1: (groupid=0, jobs=32): err=24 (file:filesetup.c:805, func=open(/home/sevag/tmpfs//f1018), error=Too many open files): pid=1169936: Wed Jul 26 09:27:17 2023
  write: IOPS=53.6k, BW=1676MiB/s (1757MB/s)(31.8MiB/19msec); 0 zone resets
    slat (nsec): min=8640, max=32961, avg=11520.54, stdev=2379.17
    clat (usec): min=41, max=2937, avg=2046.76, stdev=529.52
     lat (usec): min=53, max=2968, avg=2058.43, stdev=531.29
    clat percentiles (usec):
     |  1.00th=[  293],  5.00th=[  889], 10.00th=[ 1614], 20.00th=[ 1844],
     | 30.00th=[ 1844], 40.00th=[ 1844], 50.00th=[ 1860], 60.00th=[ 2278],
     | 70.00th=[ 2442], 80.00th=[ 2507], 90.00th=[ 2606], 95.00th=[ 2769],
     | 99.00th=[ 2900], 99.50th=[ 2933], 99.90th=[ 2933], 99.95th=[ 2933],
     | 99.99th=[ 2933]
  lat (usec)   : 50=0.10%, 250=0.59%, 500=1.67%, 750=1.67%, 1000=1.77%
  lat (msec)   : 2=48.87%, 4=45.34%
  cpu          : usr=26.32%, sys=78.95%, ctx=1, majf=0, minf=85
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=3.1%, >=64=93.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,1019,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1676MiB/s (1757MB/s), 1676MiB/s-1676MiB/s (1757MB/s-1757MB/s), io=31.8MiB (33.4MB), run=19-19msec