plotMachineIOPS_LATENCY/fio_output/write-32jobs-1files-128k.fio_tmpfs.out
jobs1: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO file (1 file / 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=178180: Tue Jul 25 19:30:24 2023
  write: IOPS=39.7k, BW=4959MiB/s (5200MB/s)(30.0GiB/6195msec); 0 zone resets
    slat (nsec): min=19380, max=64236, avg=24646.68, stdev=6356.37
    clat (nsec): min=1382, max=5539.6k, avg=3200116.89, stdev=812521.95
     lat (usec): min=23, max=5583, avg=3224.82, stdev=818.80
    clat percentiles (usec):
     |  1.00th=[ 2835],  5.00th=[ 2835], 10.00th=[ 2868], 20.00th=[ 2868],
     | 30.00th=[ 2868], 40.00th=[ 2868], 50.00th=[ 2868], 60.00th=[ 2868],
     | 70.00th=[ 2868], 80.00th=[ 2868], 90.00th=[ 5211], 95.00th=[ 5276],
     | 99.00th=[ 5276], 99.50th=[ 5276], 99.90th=[ 5342], 99.95th=[ 5342],
     | 99.99th=[ 5473]
   bw (  MiB/s): min= 3033, max= 5550, per=100.00%, avg=4977.52, stdev=1041.15, samples=12
   iops        : min=24268, max=44406, avg=39820.08, stdev=8329.26, samples=12
  lat (usec)   : 2=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=85.52%, 10=14.44%
  cpu          : usr=10.45%, sys=89.55%, ctx=4, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,245760,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=4959MiB/s (5200MB/s), 4959MiB/s-4959MiB/s (5200MB/s-5200MB/s), io=30.0GiB (32.2GB), run=6195-6195msec