plotMachineIOPS_LATENCY/fio_output/write-32jobs-512files-32k.fio_ramdisk.out
jobs1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=1103939: Wed Jul 26 06:04:05 2023
  write: IOPS=101k, BW=3153MiB/s (3306MB/s)(30.0GiB/9743msec); 0 zone resets
    slat (usec): min=6, max=711, avg= 9.33, stdev= 2.86
    clat (nsec): min=1224, max=7668.7k, avg=1258193.40, stdev=330313.68
     lat (usec): min=9, max=7818, avg=1267.59, stdev=332.82
    clat percentiles (usec):
     |  1.00th=[ 1090],  5.00th=[ 1106], 10.00th=[ 1106], 20.00th=[ 1106],
     | 30.00th=[ 1123], 40.00th=[ 1123], 50.00th=[ 1123], 60.00th=[ 1123],
     | 70.00th=[ 1123], 80.00th=[ 1139], 90.00th=[ 2024], 95.00th=[ 2040],
     | 99.00th=[ 2057], 99.50th=[ 2073], 99.90th=[ 2343], 99.95th=[ 2966],
     | 99.99th=[ 3884]
   bw (  MiB/s): min= 1901, max= 3592, per=100.00%, avg=3159.32, stdev=678.82, samples=19
   iops        : min=60846, max=114971, avg=101098.05, stdev=21722.24, samples=19
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=85.47%, 4=14.51%, 10=0.01%
  cpu          : usr=10.22%, sys=89.75%, ctx=18, majf=0, minf=71
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,983040,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=3153MiB/s (3306MB/s), 3153MiB/s-3153MiB/s (3306MB/s-3306MB/s), io=30.0GiB (32.2GB), run=9743-9743msec