plotMachineIOPS_LATENCY/fio_output/write-32jobs-512files-4k.fio_fuse_ext4.out
jobs1: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=881927: Wed Jul 26 04:45:46 2023
  write: IOPS=220k, BW=859MiB/s (900MB/s)(30.0GiB/35773msec); 0 zone resets
    slat (usec): min=2, max=133314, avg= 3.70, stdev=57.18
    clat (usec): min=2, max=255301, avg=575.94, stdev=916.82
     lat (usec): min=5, max=255308, avg=579.74, stdev=923.17
    clat percentiles (usec):
     |  1.00th=[  486],  5.00th=[  490], 10.00th=[  494], 20.00th=[  498],
     | 30.00th=[  502], 40.00th=[  506], 50.00th=[  506], 60.00th=[  510],
     | 70.00th=[  510], 80.00th=[  519], 90.00th=[  545], 95.00th=[  594],
     | 99.00th=[ 2114], 99.50th=[ 3261], 99.90th=[11731], 99.95th=[16057],
     | 99.99th=[23462]
   bw (  KiB/s): min=338181, max=1011672, per=100.00%, avg=879569.86, stdev=104035.35, samples=71
   iops        : min=84545, max=252918, avg=219892.49, stdev=26008.71, samples=71
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=20.83%, 750=76.16%, 1000=0.85%
  lat (msec)   : 2=1.08%, 4=0.65%, 10=0.28%, 20=0.12%, 50=0.02%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=18.22%, sys=72.71%, ctx=18541, majf=0, minf=70
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,7864320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=859MiB/s (900MB/s), 859MiB/s-859MiB/s (900MB/s-900MB/s), io=30.0GiB (32.2GB), run=35773-35773msec