plotMachineIOPS_LATENCY/fio_output/write-32jobs-64files-4k.fio_fuse_boc.out
jobs1: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=202823: Tue Jul 25 20:54:13 2023
  write: IOPS=364k, BW=1421MiB/s (1490MB/s)(30.0GiB/21619msec); 0 zone resets
    slat (nsec): min=1428, max=138505k, avg=2167.84, stdev=69469.82
    clat (nsec): min=1292, max=464573k, avg=345728.49, stdev=1207493.02
     lat (usec): min=2, max=464623, avg=347.97, stdev=1219.01
    clat percentiles (usec):
     |  1.00th=[  273],  5.00th=[  281], 10.00th=[  281], 20.00th=[  281],
     | 30.00th=[  285], 40.00th=[  285], 50.00th=[  285], 60.00th=[  289],
     | 70.00th=[  302], 80.00th=[  318], 90.00th=[  461], 95.00th=[  515],
     | 99.00th=[ 1020], 99.50th=[ 1074], 99.90th=[ 1188], 99.95th=[10290],
     | 99.99th=[13435]
   bw (  MiB/s): min=   70, max= 1731, per=99.97%, avg=1420.61, stdev=426.26, samples=43
   iops        : min=18064, max=443246, avg=363676.56, stdev=109122.66, samples=43
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=94.65%, 750=2.68%, 1000=1.50%
  lat (msec)   : 2=1.08%, 10=0.03%, 20=0.05%, 50=0.01%, 100=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%
  cpu          : usr=21.40%, sys=73.93%, ctx=157, majf=0, minf=73
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,7864320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1421MiB/s (1490MB/s), 1421MiB/s-1421MiB/s (1490MB/s-1490MB/s), io=30.0GiB (32.2GB), run=21619-21619msec